Revit 2024 API
FolderItemInfo Properties
The FolderItemInfo type exposes the following members.
Properties
Name | Description
ElementId
 The folder parameter Id
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The folder name
See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace